#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <assert.h>

/************************************************************************************************/
/**
 * \mainpage Ура, это моя первая документация!
 * \page Easter_Eggs
 * There are no Easter Eggs up here. Go away.
 */
/************************************************************************************************/

/************************************************************************************************/
/**
 * \brief Используется для обозначения бесконечного количества корней
 */
/************************************************************************************************/

#define SS_INF_ROOTS -2

/************************************************************************************************/
/**
 * \brief константа, используемая в функции IsZero для сравнения вещественного числа с нулем
 */
/************************************************************************************************/

const double eps=1E-10;

/************************************************************************************************/
/**
 * \brief Сравнение вещественного числа с нулем
 *
 * \param [in] d - вещественное число, сравниваемое с нулем
 *
 * \return 1 в случае равенства нулю, 0, если число нулю не равно
 */
/************************************************************************************************/

int IsZero(double d)
{
    if (fabs(d)<eps)
        return 1;
    else
        return 0;
}

/************************************************************************************************/
/**
 * \brief Вычисление дискриминанта квадратного уравнения вида ax^2+bx+с=0
 *
 * \param [in] a - коэффициент
 * \param [in] b - коэффициент
 * \param [in] c - коэффициент
 *
 * \return Значение дискриминанта
 */
/************************************************************************************************/

double D(double a, double b, double c)
{
    return b*b-4*a*c;
}

/************************************************************************************************/
/**
 * \brief Ввод данных
 *
 * \param [out] a - указатель на первый коэффициент
 * \param [out] b - указатель на второй коэффициент
 * \param [out] c - указатель на третий коэффициент
 *
 * \return Статус окончания работы функции
 */
/************************************************************************************************/

int input(double *a, double *b, double *c)
{
    double t=0;
    printf("Enter quadratic equation's coefficients (ax^2+bx+c=0): \n");
    printf("a=");
    scanf("%lg",a);
    printf("b=");
    scanf("%lg",b);
    printf("c=");
    scanf("%lg",c);
    printf("\n");

    return 0;
}

/************************************************************************************************/
/**
 * \brief Нахождение корней квадратного уравнения вида ax^2+bx+c=0
 *
 * \param [in] a - коэффициент
 * \param [in] b - коэффициент
 * \param [in] c - коэффициент
 *
 * \param [out] x1 - указатель на первый корень
 * \param [out] x2 - указатель на второй корень
 *
 * \return Количество корней квадратного уравнения
 */
/************************************************************************************************/

int calculation(double a, double b, double c, double *x1, double *x2)
{
    if (!IsZero(a))
    {
        double discr=D(a,b,c);

        if (IsZero(discr))
        {
            *x1=*x2=-b/(2*a);

            return 1;
        };

        if (discr>0)
        {
            double sqrt_discr=sqrt(discr);

            *x1=(-b+sqrt_discr)/(2*a);
            *x2=(-b-sqrt_discr)/(2*a);

            return 2;
        }
        else
            return 0;
    }
    else
    {
        if (IsZero(b))
        {
            if (IsZero(c))
                return SS_INF_ROOTS;
            else
                return 0;
        }
        else
        {
            *x1=*x2=-c/b;

            return 1;
        }
    }
}

 /**
 *  \cond
 */

int TestCalculation()
{
    double x3=0;
    double x4=0;
    assert(calculation(0,0,0,&x3,&x4)==SS_INF_ROOTS);
    assert(calculation(0,0,1,&x3,&x4)==0);
    assert(calculation(1,0,0,&x3,&x4)==1);
    assert(calculation(1,3,1,&x3,&x4)==2);

    printf("All tests were passed successfully\n");

    return 0;
}

/**
 *  \endcond
 */

/************************************************************************************************/
/**
 * \brief Вывод результата решения
 *
 * \param [in] num - число корней
 * \param [in] x1 -  корень
 * \param [in] x2 -  корень
 *
 * \return Статус окончания работы функции
 */
/************************************************************************************************/

int output(int num, double x1, double x2)
{
    switch (num)
    {
        case 0:

            printf("No roots\n");
            break;

        case 1:

            printf("x=%lg\n",x1);
            break;

        case 2:

            printf("x1=%lg\nx2=%lg\n",x1,x2);
            break;

        case SS_INF_ROOTS:

            printf("Any number\n");
            break;

        default:

            printf("main(): ERROR: there can be only one,2,0,inf roots, but num=%d\n",num);
            return -1;
    }
    printf("\n");

    return 0;
}

/**
 * \brief Точка вхождения
 *
 * Выполнение программы начинается здесь
 *
 * \return Статус окончания работы программы
 */

int main()
{
    double a,b,c,x1,x2;
    a=b=c=x1=x2=0;

    input(&a,&b,&c);

    int num = calculation(a,b,c,&x1,&x2);

    output(num,x1,x2);

    TestCalculation();

    //printf("Hello world!\n");
    return 0;
}
